nxp-mcuxpresso/mcuxsdk-examples/_boards/mcxw23evk/common/pin_mux/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXW236
package_id: MCXW236BIHNAR
mcu_data: ksdk2_0
processor_version: 0.2506.10
expansion_headers:
- id: single_row_arduino
  name: Adruino
  connectors:
  - id: C1
    name: J23
    pins:
    - {id: 2, name: VIO, external_signal_types: power_supply_3.3V}
    - {id: 3, pin_num: '13', pin_signal: RESET_N}
    - {id: 4, name: VIO, external_signal_types: power_supply_3.3V}
    - {id: 5, name: NC, external_signal_types: power_supply_5V}
  - id: C2
    name: J24
    pins:
    - {id: 3, name: D10, pin_num: '31', pin_signal: PIO0_0/FC0_CTS_SDA_SSEL0/FC1_RTS_SCL_SSEL1/SEC_PIO0_0/CTIMER0_MAT0/CTIMER_INP0}
    - {id: 4, name: D11, pin_num: '2', pin_signal: PIO0_2/FC0_RXD_SDA_MOSI/SCT_OUT9/SEC_PIO0_2/CTIMER0_MAT2/CTIMER_INP2}
    - {id: 5, name: D12, pin_num: '3', pin_signal: PIO0_3/FC0_TXD_SCL_MISO/SCT_OUT8/FREQME_GPIO_3/SEC_PIO0_3/CTIMER0_MAT3/CTIMER_INP3}
    - {id: 6, name: D13, pin_num: '4', pin_signal: PIO0_4/FC0_SCK/SCT_OUT7/SEC_PIO0_4/CTIMER1_MAT0/CTIMER_INP4}
    - {id: 8, name: AREF, external_signal_types: aref}
    - {id: 9, name: D14, pin_num: '2', pin_signal: PIO0_2/FC0_RXD_SDA_MOSI/SCT_OUT9/SEC_PIO0_2/CTIMER0_MAT2/CTIMER_INP2}
    - {id: 10, name: D15, pin_num: '3', pin_signal: PIO0_3/FC0_TXD_SCL_MISO/SCT_OUT8/FREQME_GPIO_3/SEC_PIO0_3/CTIMER0_MAT3/CTIMER_INP3}
  - id: C3
    name: J26
    pins:
    - {id: 1, pin_num: '2', pin_signal: PIO0_2/FC0_RXD_SDA_MOSI/SCT_OUT9/SEC_PIO0_2/CTIMER0_MAT2/CTIMER_INP2}
    - {id: 2, name: D1, pin_num: '3', pin_signal: PIO0_3/FC0_TXD_SCL_MISO/SCT_OUT8/FREQME_GPIO_3/SEC_PIO0_3/CTIMER0_MAT3/CTIMER_INP3}
  - {id: C4, name: J25}
- id: micro_bus
  name: mikroBUS-FLEXCOMM0
  connectors:
  - id: C1
    name: J14
    pins:
    - {id: 3, name: CS, pin_num: '31', pin_signal: PIO0_0/FC0_CTS_SDA_SSEL0/FC1_RTS_SCL_SSEL1/SEC_PIO0_0/CTIMER0_MAT0/CTIMER_INP0}
    - {id: 4, name: SCK, pin_num: '4', pin_signal: PIO0_4/FC0_SCK/SCT_OUT7/SEC_PIO0_4/CTIMER1_MAT0/CTIMER_INP4}
    - {id: 5, name: MISO, pin_num: '3', pin_signal: PIO0_3/FC0_TXD_SCL_MISO/SCT_OUT8/FREQME_GPIO_3/SEC_PIO0_3/CTIMER0_MAT3/CTIMER_INP3}
    - {id: 6, name: MOSI, pin_num: '2', pin_signal: PIO0_2/FC0_RXD_SDA_MOSI/SCT_OUT9/SEC_PIO0_2/CTIMER0_MAT2/CTIMER_INP2}
    - {id: 7, name: VCC_MIKROE, external_signal_types: power_supply_3.3V}
  - id: C2
    name: J15
    pins:
    - {id: 3, name: RX, pin_num: '2', pin_signal: PIO0_2/FC0_RXD_SDA_MOSI/SCT_OUT9/SEC_PIO0_2/CTIMER0_MAT2/CTIMER_INP2}
    - {id: 4, name: TX, pin_num: '3', pin_signal: PIO0_3/FC0_TXD_SCL_MISO/SCT_OUT8/FREQME_GPIO_3/SEC_PIO0_3/CTIMER0_MAT3/CTIMER_INP3}
    - {id: 5, name: SCL, pin_num: '3', pin_signal: PIO0_3/FC0_TXD_SCL_MISO/SCT_OUT8/FREQME_GPIO_3/SEC_PIO0_3/CTIMER0_MAT3/CTIMER_INP3}
    - {id: 6, name: SDA, pin_num: '2', pin_signal: PIO0_2/FC0_RXD_SDA_MOSI/SCT_OUT9/SEC_PIO0_2/CTIMER0_MAT2/CTIMER_INP2}
    - {id: 7, name: NC, external_signal_types: power_supply_5V}
- id: micro_bus
  name: mikroBUS-FLEXCOMM1
  connectors:
  - id: C1
    name: J18
    pins:
    - {id: 3, pin_num: '35', pin_signal: PIO0_15/SWO/FC1_CTS_SDA_SSEL0/SCT_OUT0/PLU_OUT3/SEC_PIO0_15/ANT_SWITCH_0/CTIMER3_MAT3/CTIMER_INP15}
    - {id: 4, pin_num: '32', pin_signal: PIO0_16/FC1_SCK/SCT_GPI3/PLU_OUT4/SEC_PIO0_16/ANT_SWITCH_1/CTIMER4_MAT0/CTIMER_INP16}
    - {id: 5, pin_num: '5', pin_signal: PIO0_14/FC1_TXD_SCL_MISO/FC2_RTS_SCL_SSEL1/SCT_OUT1/FREQME_GPIO_14/UTICK_CAP3/PLU_OUT2/SEC_PIO0_14/CTIMER3_MAT2/CTIMER_INP14}
    - {id: 6, pin_num: '6', pin_signal: PIO0_13/FC1_RXD_SDA_MOSI/FC2_CTS_SDA_SSEL0/SCT_OUT2/UTICK_CAP2/PLU_OUT1/SEC_PIO0_13/CTIMER3_MAT1/CTIMER_INP13}
    - {id: 7, name: VCC_MIKROE, external_signal_types: power_supply_3.3V}
  - id: C2
    name: J17
    pins:
    - {id: 3, pin_num: '6', pin_signal: PIO0_13/FC1_RXD_SDA_MOSI/FC2_CTS_SDA_SSEL0/SCT_OUT2/UTICK_CAP2/PLU_OUT1/SEC_PIO0_13/CTIMER3_MAT1/CTIMER_INP13}
    - {id: 4, pin_num: '5', pin_signal: PIO0_14/FC1_TXD_SCL_MISO/FC2_RTS_SCL_SSEL1/SCT_OUT1/FREQME_GPIO_14/UTICK_CAP3/PLU_OUT2/SEC_PIO0_14/CTIMER3_MAT2/CTIMER_INP14}
    - {id: 5, pin_num: '5', pin_signal: PIO0_14/FC1_TXD_SCL_MISO/FC2_RTS_SCL_SSEL1/SCT_OUT1/FREQME_GPIO_14/UTICK_CAP3/PLU_OUT2/SEC_PIO0_14/CTIMER3_MAT2/CTIMER_INP14}
    - {id: 6, pin_num: '35', pin_signal: PIO0_15/SWO/FC1_CTS_SDA_SSEL0/SCT_OUT0/PLU_OUT3/SEC_PIO0_15/ANT_SWITCH_0/CTIMER3_MAT3/CTIMER_INP15}
    - {id: 7, name: NC, external_signal_types: power_supply_5V}
- id: micro_bus
  name: mikroBUS-FLEXCOMM2
  connectors:
  - id: C1
    name: J20
    pins:
    - {id: 3, pin_num: '37', pin_signal: PIO0_5/FC2_CTS_SDA_SSEL0/SCT_OUT6/UTICK_CAP0/PLU_IN0/SEC_PIO0_5/SPIFI_CSN/CTIMER1_MAT1/CTIMER_INP5}
    - {id: 4, pin_num: '11', pin_signal: PIO0_10/FC2_SCK/SCT_GPI5/PLU_IN5/SEC_PIO0_10/SPIFI_CLK/CTIMER2_MAT2/CTIMER_INP10}
    - {id: 5, pin_num: '38', pin_signal: PIO0_7/FC2_TXD_SCL_MISO/SCT_OUT4/UTICK_CAP2/PLU_IN2/SEC_PIO0_7/SPIFI_IO1/CTIMER1_MAT3/CTIMER_INP7/ANT_SWITCH_1}
    - {id: 6, pin_num: '10', pin_signal: PIO0_6/FC2_RXD_SDA_MOSI/SCT_OUT5/UTICK_CAP1/PLU_IN1/SEC_PIO0_6/SPIFI_IO0/CTIMER1_MAT2/CTIMER_INP6/ANT_SWITCH_0}
    - {id: 7, name: VCC_MIKROE, external_signal_types: power_supply_3.3V}
  - id: C2
    name: J21
    pins:
    - {id: 1, pin_num: '39', pin_signal: PIO0_8/FC2_RTS_SCL_SSEL1/SCT_GPI7/UTICK_CAP3/PLU_IN3/SEC_PIO0_8/SPIFI_IO2/CTIMER2_MAT0/CTIMER_INP8/ANT_SWITCH_2}
    - {id: 2, pin_num: '12', pin_signal: PIO0_9/SCT_GPI6/CLKOUT/PLU_IN4/SEC_PIO0_9/SPIFI_IO3/CTIMER2_MAT1/CTIMER_INP9/ANT_SWITCH_3}
    - {id: 3, pin_num: '10', pin_signal: PIO0_6/FC2_RXD_SDA_MOSI/SCT_OUT5/UTICK_CAP1/PLU_IN1/SEC_PIO0_6/SPIFI_IO0/CTIMER1_MAT2/CTIMER_INP6/ANT_SWITCH_0}
    - {id: 4, pin_num: '38', pin_signal: PIO0_7/FC2_TXD_SCL_MISO/SCT_OUT4/UTICK_CAP2/PLU_IN2/SEC_PIO0_7/SPIFI_IO1/CTIMER1_MAT3/CTIMER_INP7/ANT_SWITCH_1}
    - {id: 5, pin_num: '38', pin_signal: PIO0_7/FC2_TXD_SCL_MISO/SCT_OUT4/UTICK_CAP2/PLU_IN2/SEC_PIO0_7/SPIFI_IO1/CTIMER1_MAT3/CTIMER_INP7/ANT_SWITCH_1}
    - {id: 6, pin_num: '10', pin_signal: PIO0_6/FC2_RXD_SDA_MOSI/SCT_OUT5/UTICK_CAP1/PLU_IN1/SEC_PIO0_6/SPIFI_IO0/CTIMER1_MAT2/CTIMER_INP6/ANT_SWITCH_0}
    - {id: 7, name: NC, external_signal_types: power_supply_5V}
pin_labels:
- {pin_num: '7', pin_signal: PIO0_19/FC2_TXD_SCL_MISO/SCT_GPI0/PLU_OUT7/SEC_PIO0_19/CTIMER4_MAT3/CTIMER_INP19, label: 'J12[9]/R14/Q1[G]/J36[7]', identifier: LED_R}
- {pin_num: '1', pin_signal: PIO0_1/FC0_RTS_SCL_SSEL1/FC2_SCK/PLU_CLKIN/SEC_PIO0_1/CTIMER0_MAT1/CTIMER_INP1, label: 'J13[3]/J12[3]', identifier: SENSOR_INT}
- {pin_num: '4', pin_signal: PIO0_4/FC0_SCK/SCT_OUT7/SEC_PIO0_4/CTIMER1_MAT0/CTIMER_INP4, label: 'R169/SH203/D13[4]/J1[7]/SH7/LED_BLUE/RGB_B'}
- {pin_num: '8', pin_signal: PIO0_18/FC2_RXD_SDA_MOSI/SCT_GPI1/CLKOUT/PLU_OUT6/SEC_PIO0_18/CTIMER4_MAT2/CTIMER_INP18, label: 'J36[5]/J12[8]/R21/SW4', identifier: SW4}
- {pin_num: '30', pin_signal: PIO0_20/SEC_PIO0_20/CTIMER_INP20, label: 'R15/J8[17]/D17/R100/SW2', identifier: SW2}
- {pin_num: '14', pin_signal: PIO0_21/WAKEUP/SEC_PIO0_21/CTIMER_INP21, label: 'J8[19]/R16/SW3/D1', identifier: SW3}
- {pin_num: '3', pin_signal: PIO0_3/FC0_TXD_SCL_MISO/SCT_OUT8/FREQME_GPIO_3/SEC_PIO0_3/CTIMER0_MAT3/CTIMER_INP3, label: 'J12[18]/J19[12]/J13[11]/R151/J14[5]/R158/J15[4]/R159/J15[5]/R116/J24[10]/J24[5]/R120/R123/J26[2]/R95/U22[5]/J36[3]',
  identifier: DEBUG_UART_TX}
- {pin_num: '2', pin_signal: PIO0_2/FC0_RXD_SDA_MOSI/SCT_OUT9/SEC_PIO0_2/CTIMER0_MAT2/CTIMER_INP2, label: 'J12[1]/J19[10]/J13[7]/R152/J14[6]/R157/J15[3]/R160/J15[6]/J24[9]/R118/R121/J24[4]/R124/J26[1]/DBGIF_TMS_SWDIO/R96/U22[4]/J36[1]',
  identifier: DEBUG_UART_RX}
- {pin_num: '5', pin_signal: PIO0_14/FC1_TXD_SCL_MISO/FC2_RTS_SCL_SSEL1/SCT_OUT1/FREQME_GPIO_14/UTICK_CAP3/PLU_OUT2/SEC_PIO0_14/CTIMER3_MAT2/CTIMER_INP14, label: 'J13[13]/R140/R136/R137/J17[4]/J17[5]/U24[8]/J12[4]/J19[8]',
  identifier: SENSOR_I2C_SCL}
- {pin_num: '6', pin_signal: PIO0_13/FC1_RXD_SDA_MOSI/FC2_CTS_SDA_SSEL0/SCT_OUT2/UTICK_CAP2/PLU_OUT1/SEC_PIO0_13/CTIMER3_MAT1/CTIMER_INP13, label: 'J13[9]/R141/J18[6]/R135/J17[3]/J17[6]/R134/U24[1]/J12[5]/J19[6]',
  identifier: SENSOR_I2C_SDA}
- {pin_num: '33', pin_signal: PIO0_12/SWDIO/FC1_RTS_SCL_SSEL1/SCT_OUT3/FREQME_GPIO_12/UTICK_CAP1/PLU_OUT0/SEC_PIO0_12/CTIMER3_MAT0/CTIMER_INP12, label: 'R53/R105/U25[4]/J8[18]/R23/J11[2]/D7',
  identifier: SWDIO}
- {pin_num: '28', pin_signal: PIO0_17/SWO/FC0_CTS_SDA_SSEL0/SCT_GPI2/PLU_OUT5/SEC_PIO0_17/ANT_SWITCH_2/CTIMER4_MAT1/CTIMER_INP17, label: 'R52/R114/J12[17]/R22/D5/J11[6]',
  identifier: SWO}
- {pin_num: '10', pin_signal: PIO0_6/FC2_RXD_SDA_MOSI/SCT_OUT5/UTICK_CAP1/PLU_IN1/SEC_PIO0_6/SPIFI_IO0/CTIMER1_MAT2/CTIMER_INP6/ANT_SWITCH_0, label: 'MCX_SPI_SOUT/R1/TP6/U12[5]/J22[3]/SH205/SH12/J2[7]'}
- {pin_num: '11', pin_signal: PIO0_10/FC2_SCK/SCT_GPI5/PLU_IN5/SEC_PIO0_10/SPIFI_CLK/CTIMER2_MAT2/CTIMER_INP10, label: 'MCX_SPI_SCK/R7/TP3/U12[6]/SH14/J2[5]/SH34/J6[4]/SH207'}
- {pin_num: '34', pin_signal: PIO0_11/SWCLK/FC1_CTS_SDA_SSEL0/SCT_GPI4/FREQME_GPIO_11/UTICK_CAP0/PLU_CLKIN/SEC_PIO0_11/CTIMER2_MAT3/CTIMER_INP11, label: 'R60/R24/D6/J11[4]/R109',
  identifier: SWCLK}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "pin_mux.h"

